export const coverLetter = {
  home: {
    text: '>> 프로필로 돌아가기',
    link: '/cv',
  },
  tableOfContents: {
    title: '📓목차',
    contents: [
      { text: '📍왜 개발자가 되고자 하는가', index: 'why' },
      { text: '📍Strength', index: 'strength' },
      { text: '📍How to', index: 'how' },
    ],
  },
  element: [
    {
      index: 'why',
      subject: '왜 개발자가 되고자 하는가✨',
      contents: [
        {
          subtitle:
            '개발이란 일상 속에서 마주하는, 사회에서 발생하는 문제에 대한 대안이 될 수 있고, 저는 문제를 해결하는 일을 하고 싶어 시작했습니다.',
          content: `   제가 개발을 시작하게 된 이유는 <u>개발은 문제를 해결하는 대안</u>이기 때문입니다. 여기서 문제는 작게는 코딩을 하면서 마주하는 장애가 될 수도 있지만 넓게 보면 일상 속에서 마주하는, 사회에서 발생하는 문제도 될 수 있다고 생각합니다. 예를 들어 인프런은 교육기회가 적은 수도권 이외의 지역에 있는 사람에게, 시간적 한계가 있는 사람에게 배움의 기회를 제공해주었고, 배달의 민족, 요기요, 쿠팡이츠 등은 코로나로 힘든 요식업 자영업자에게 언택트 서비스의 활로를 열어주었습니다. 이외에도 포스트 코로나 시대에 개발은 디지털 트랜스포메이션을 통해 사용자들에게 편의와 더불어 다양한 기회를 제공해주었습니다
   개발이 사업만을 통해 대안이 될수 있는 것은 아닙니다. 저는 사소한 기능 개발/개선으로 사용자 경험을 개선하고 사용자층을 넓히는 것과 기업의 비용을 기술을 통해 절감해주는 것 또한 개발이 제시하는 대안이라고 생각합니다. 꼭 거대하지 않아도 제 자리에서, <b>개발자로서 서비스나 제품에 대한 목적을 가지고 최선으로 임하는 것으로 사회를 더 살기 좋게 만드는 데에 큰 역할을 하는 것</b>이라 생각합니다. 그리고 그것이 개발자의 가장 큰 매력으로 다가왔습니다.
   제 이러한 가치관은 개발을 할 때도 사용자에게 더 좋은, 더 가치있는 기능을 만들어내는 원동력이 될 것입니다.`,
        },
      ],
    },
    {
      index: 'strength',
      subject: 'Strength🔥',
      contents: [
        {
          subtitle:
            '목표를 달성하기 위해 나의 역할과 역량에 대해 끊임없이 고민하고 성장시키는 지원자',
          content: `   제 강점은 <u>주도적으로 저에게 주어진 업무의 목표에 따른 제 역할과 역량을 고민하며 업무를 수행하고, 또 적극적으로 성장시킨다는 것</u>입니다. 저는 학부 수업을 들으면서 마주치는 팀프로젝트를 하든 아르바이트를 하든 제가 무엇을 할 수 있는지, 목표와 나의 역량에 맞는 역할이 무엇인지 고민하며 주어진 일을 효율적이면서 좋은 결과를 낼 방법을 모색하는 사람입니다.
   예를 들어 목표에 대해 고민하고 주도적으로 행동하는 제 태도는 상당수의 프로젝트에서 스스럼없이 팀장으로서 프로젝트를 이끌어 가는 역할을 선택하는 이유가 되었습니다. 그러나 조원들의 성향이나 기존의 친밀도, 학년 구성, 프로젝트의 진행 방식 등에 따라서는 프로젝트 결과를 취합하여 정리하는 보고서 작성, 발표자료 제작, 발표 등을 일부러 맡아 보조하는 역할을 자처하기도 하였습니다. 반대로 경험과 지식이 부족한 주제의 프로젝트일 경우에도 발표자료 제작 등을 맡기도 하였습니다. 제가 명확하게 기여할 수 있다고 생각되는 임무를 찾되 부족한 부분은 발표자료를 제작하기 전부터 공부를 하여 팀에 짐이 되기보다 충분한 이해를 가지고 기여할 수 있도록 하였습니다. <b>어느 역할을 맡든 스스로 조장 못지 않거나 더더욱 적극적으로 참여할 것</b>임을 알고 있었기 때문에 제가 가진 능력으로 좋은 결과물을 내기 위해 어떻게 포지셔닝을 하는 것이 협업을 함에 있어서 가장 기여를 할 수 있을지 고민하며 일을 하고자 하였습니다.`,
        },
        {
          subtitle: '주어진 역할에 주도적이고 열정적으로 임하는 지원자',
          content: `   특히 가장 최근에 국비지원 학원을 다니면서 진행한 파이널 팀프로젝트에서 팀장이라는 역할을 수행했을 때 저의 강점이 빛을 발했습니다. 먼저 제가 팀장으로서 어떤 역할을 해야할지, 가진 역량으로 팀프로젝트를 원활하게 진행하면서 만족스러운 결과물을 만들기 위하여 무엇을 할 수 있을지 고민하였습니다. 팀장으로서 제가 할 수 있는 일은 저의 여러 프로젝트 리더 경험을 가지고 목표와 방향성을 가지고 이끌어 가는 것과 능력 및 성향에 따른 역할 분배를 하고 부족한 부분을 채워가는 것이라고 판단했습니다.
   이를 위해 먼저 장기적으로 대비가 필요한 저희 팀이 사용할 기술에 대한 공부를 하며, 특히 학원 커리큘럼과 기간적으로 부족한 부분을 개인 공부로 채워 개발을 리드할 때 해당 기술들이 걸림돌이 되지 않도록 노력하였습니다. 프로젝트 진행을 위해 포털사이트 검색하고 강사님께 조언을 얻는 것은 물론 저희 조가 선택한 기술 스택과 유사한 기술을 사용하는 책을 구매하여 어떻게 진행할지 힌트를 얻고자 하기도 하였습니다.
   또한 실질적인 개발에 들어가기 전에 조원들에게 숙제를 내주고 검사를 하며 구조적으로 이해가 필요한 부분을 보완해주면서 협업하기 좋은 코드에 대해 고민하도록 하였고, 동시에 주어진 기능이나 설계도에 따라 작성할 수 있는 구현 및 코드 설계능력과 코드수준, 적극성 등을 파악하여 적절한 파트를 담당하도록 분배하였습니다. 또 간단한 테스트 코드를 작성하여 개발환경을 설치할 때 정상적으로 작동하는지 확인할 수 있는 코드를 작성하면서 동시에 개발할 때의 가이드라인을 제공하고자 하였습니다.
   각자가 담당한 메뉴 카테고리를 되도록 전부 개발하는 것을 목표로 하여 문제가 있을 때는 함께 고민하고 또 서로 격려해주며 개발하였지만 화면구현을 많이 어려워하여 그 개발 속도로는 일정에 큰 차질이 생길 것 같을 때는 제가 적극적으로 나서서 팀장으로서 해당 부분을 채우고자 하였습니다. 그 결과 저희 조는 스스로 만족하고 자부심을 가질 수 있으면서 다른 수강생들도 인정해주는 웹사이트를 만들게 되었습니다.`,
        },
        {
          subtitle:
            '“믿을 만한 조장” “자격증 따서 정규직으로 지원하는 건 어때요?” “네가 팀장인 조에 들어가고 싶었어”',
          content: `   위의 말들은 제가 프로젝트 조장으로 수행하면서, 또는 아르바이트생으로서 들었던 말들입니다. 제 강점은 추진력에 날개를 달아 맡은 일에는 성과를, 조원이나 상사에게는 신뢰를 얻는 날개 옷이 되었습니다. 제 강점으로 회사에도 날개를 달아주는 개발자가 될 수 있도록 하겠습니다.`,
        },
      ],
    },
    {
      index: 'how',
      subject: 'How to🔥',
      contents: [
        {
          subtitle: '누구나 인정하는 열정과 노력으로',
          content: `   개발자가 되기로 결심한 후 웹 개발의 기초를 쌓기 위해 혼자서 HTML, CSS와 JavaScript를 공부하기 시작했습니다. 또한 익숙하지 않은 용어가 많아서 초반에 어려움을 겪었기 때문에 여러 가지 책과 영상을 찾아보며 IT 문해력을 높이려 했습니다. 그러나 혼자서 공부했을 때 커리큘럼을 짜기가 어려웠고 진도를 나가는 속도가 목표했던 것보다 느려서 KH정보교육원에 다니기로 결심했습니다.
   이후 자바와 파이썬 기초에 대한 온라인 강의를 듣고 개발과 관련된 책들을 읽으며 개강 후 빠르게 진행될 커리큘럼을 따라가는 데에 문제가 없도록 대비했습니다. 제가 학원을 다니기로 선택한 것은 공부에 속도를 높이면서 제가 혼자 짜는 것보다 더 적절한 커리큘럼에 따라 공부하기 위해서 였기 때문에 그 목표를 잃지 않고자 하였습니다. 따라서 개강하고서 매일매일 그날 배운 것들을 복습하며 새로 알게 된 것, 이해가 안 되는 것, 인상적인 것들을 정리하고 수업에서 실습한 코드들을 변형하고 확장해 본 후 이를 정리해서 블로그에 올렸습니다. 또한 수업에서 배우는 내용으로는 부족하다고 생각되어 커리큘럼에 맞추어 심화공부를 진행하였습니다. 함께 공부할 책이나 온라인 강의를 찾아가며 들었고 이 공부의 목적은 개발할 때 활용하고자 하는 것이기 때문에 항상 왜 사용하는지, 언제 어떻게 사용할 수 있는지, 더 좋은 방법은 없는지 고민하고 이해하면서 목적을 잊지 않고자 하였습니다.
   이외에 추가로 필요하다고 생각되는 부분은 검색 뿐만 아니라 책이나 공식문서 및 튜토리얼과 온라인 강의 등으로 채우며 다양한 방식으로 성장하려 하고 있습니다. 공부할 시간이 너무나도 부족하였기 때문에 30분에서 1시간 일찍 수업에 가서 미리 공부하고 있었고 수업이 끝나도 남아서 보충 공부를 하였습니다. 주말에도 공부하였고 종강까지는 이 열정으로 사적인 약속조차 일부러 잡지 않고 100% 출석률을 이루며 개발공부를 우선시하겠다는 목표로 공부해왔습니다.`,
        },
        {
          subtitle: '더 나은 코드를 찾아 변형하고 구조화 해가며 이해하다',
          content: `   책을 찾아가며 공부하는 중에는 이해하지 못하는 부분을 마주하기도 하였습니다. 제게는 자바 공부를 할 때 TCP 소켓 프로그래밍과 멀티 스레드, 입출력 스트림을 활용한 채팅 프로그램을 만드는 실습을 할 때가 특히나 그러한 순간이었습니다. 처음 목표는 소개된 기능과 설계를 참고하여 예제를 보지 않고 채팅 프로그램을 만드는 것이었습니다. 그러나 멀티 스레드가 여기서 왜 필요한지 이해하지 못했고 블로킹과 예외처리에 대한 이해도 부족한 듯 하였습니다. 무엇보다도 이 프로그램의 동작구조가 그려지지 않았습니다. 구조적으로 문제있나 싶어 좀더 구체적으로 설명된 설계 골자만 따와서 다시 시도하였으나 실패하였고, 예제코드를 쳐보고 다시 시도하였으나 실패하였습니다.
   결국 저는 특단의 조치로 주말동안 참고할 수 있는 예제코드를 의미와 목적을 한 줄 한 줄 분석하였고 각 객체간 역할과 관계를 도식화하며 이해하려 노력하였습니다. 특히 코드의 시퀀스를 이해하기 위해 어떤 흐름으로 동작하는지, 어떤 데이터를 주고받는지 하나하나 분석하였습니다. 또한 이해하고 활용하는 데에 있어서 부족하다고 느껴지는 개념과 방법들을 찾아가며 해당 프로그램에서 어떻게 활용되고 있는지 이해하고자 하였습니다.
   이러한 과정을 거친 끝에 동작구조와 흐름을 이해하였다고 생각되었을 때에 실습 코드를 보지 않고 이 프로그램을 다시 구현하였습니다. 게다가 분석하면서 코드를 외울 정도로 여러 번 읽었고 설계를 그대로 가져오다보니 예제 코드와 완전히 다른 독자적인 코드를 작성한 것은 아니었으나 조금이라도 개선하려 노력하였습니다. 예를 들어 리소스가 제대로 닫히지 않아 자원이 낭비되고 있다고 생각되는 것은 개선하였고 필요에 따라 로직을 다른 메서드로 분리하여 재사용되도록 하였습니다. 특히 기존에는 없던 조용히 퇴장하기 기능까지 추가하며 기능을 좀 더 확장하려고 노력하기도 하였습니다. 이 경험은 제가 어렵게 느껴지는 것도 두려워하기보다 핵심을 파악하고 부족한 부분을 반복적으로, 구조적으로 공부한다면 충분히 이해하고 성장할 수 있다는 것을 알게 해주었습니다.`,
        },
        {
          subtitle: '뜨거운 가슴과 차가운 머리로',
          content: `   저는 이처럼 뜨거운 열정과 차가운 이성으로 차곡차곡 직무역량을 쌓아왔습니다. 입사 후에도 이러한 노력을 게을리 하지 않고 업무 수행 중 부족한 부분 또는 더 심도있게 기술을 습득해야겠다고 생각되는 부분을 분석하고 다양한 방식으로 채워서 내일이 기대되는 개발자가 되도록 하겠습니다.`,
        },
      ],
    },
  ],
};
